//=====================================================================
//项目：F401-WS2812b-ADA6
//文件：/src/Controller/CopyF2S.s
//SPDX标识：SPDX-License-Identifier: LGPL-3.0-only
//版权所有：Copyright (C) 2025 张烁
//		芯星-X++开发团队（https://gitee.com/CoreStarXpp）
//协议：完整文本见/LICENSES/lgpl-3.0.txt
//=====================================================================

//*********************************************************************
//将主程序从Flash搬运到SRAM运行
//Flash运行易触发硬错误，且运行速度远远不足
//*********************************************************************

//---------------------------------------------------------------------
//Start
//平台：STM32F401RCT6 HSI=16MHz
//编译器：arm-none-eabi

.syntax unified
.cpu cortex-m4				//指定Cortex-M4内核
.thumb					//指定Thumb语法
.global _start				//声明全局_start

.text

.word 0x20010000			//栈顶（64Kb）
.word _start+1				//程序起始位置

//向量表省略，可以在此添加

_start:
	MOV R0, #0x08000000		//Flash起始位置
	MOV R1, #0x20000000		//SRAM起始位置
	MOV R2, #0x100			//加载程序大小（对齐）
	ADD R0, R0, R2			//R0指向主程序起始位置
	MOV R2, #0x500			//主程序大小（对齐）
	ADD R2, R0, R2			//R2指向主程序结束位置
CopyF2S:
	LDR R3, [R0], #4		//读取Flash数据，并将R0+4（32位数，即一个寄存器）
	STR R3, [R1], #4		//写入SRAM数据
	CMP R0, R2			//检测是否完成
	BNE CopyF2S			//未完成继续
	MOV LR, #0x20000000		//加载主程序起始位置
	ADD LR, LR, #1			//地址+1以防报错
					//等效指令
					//MOVW LR, #0x1
					//MOVT LR, #0x2000
	BX LR				//跳转到主程序
					//等效指令
					//B #0x20000001

//End
//---------------------------------------------------------------------